app/views/commandes/_form.html.erb

			<!-- Client -->
			<%= f.association :client, :collection => Client.all, :prompt => "Choisissez un client",
			  :key => :id , :label_method => :form_title , :disabled => @commande.isFreeze%>
---
SELECT "clients".* FROM "clients"