app/controllers/clients_controller.rb

  def index
    @q= Client.search(params[:q])
---
SELECT "clients".* FROM "clients"

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "925"]]

  def uploadFile
    @token = :clients
    file_data = params[:my_file]
    errs = []

    if file_data.respond_to?(:read)
    csv_contents = file_data.read
    elsif file_data.respond_to?(:path)
      csv_contents = File.read(file_data.path)
    else
      logger.error "Bad file_data: #{file_data.class.name}: #{file_data.inspect}"
    end

    CSV.parse(csv_contents, {:headers => true, :col_sep => ";", :quote_char => '"'}) do |row|
      client = Client.build_from_csv(row)
      # Save upon valid
      # otherwise collect error records to export
      if client.valid?
      client.save
---
INSERT INTO "clients" ("bat", "bp", "codepostal", "commentaire", "created_at", "email", "fax", "latitude", "long_adresse", "longitude", "nom", "nom_info", "num_client", "num_tva", "num_voie", "pays", "portable", "tel", "updated_at", "ville") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "clients" SET "num_client" = 185, "num_voie" = '21 RUE DES POMMIERS', "ville" = '95480 PIERRELAYE', "long_adresse" = ' 21 RUE DES POMMIERS 95480 PIERRELAYE', "email" = NULL, "latitude" = 49.0150186, "longitude" = 2.1525934, "updated_at" = '2012-11-16 11:36:58.147054' WHERE "clients"."id" = 1054