app/controllers/commandes_controller.rb

  def index
    @q= Commande.search(params[:q], :include => [:client])
---
SELECT "commandes".* FROM "commandes"

  def new_with_client
    @commande = Commande.new
    @commande.date_factu = Date.today.strftime('%d/%m/%Y')
    @commande.num_factu = Commande.next_num_factu
    @commande.client_id = params[:id]
    Produit.all.each do |produit|
---
SELECT "produits".* FROM "produits"

  def new(idClient=nil)
    @commande = Commande.new
    @commande.date_factu = Date.today.strftime('%d/%m/%Y')
    @commande.num_factu = Commande.next_num_factu
    Produit.all.each do |produit|
---
SELECT "produits".* FROM "produits"