app/controllers/produits_controller.rb

  def index
    @produits = Produit.all
---
SELECT "produits".* FROM "produits"